[{"title": "Oregon's Lady Macbeth", "author": "Olivia Nuzzi", "text": "In honor of Valentines Day, Oregons governor lets his scandal-prone fianc ruin his political career.\n\nOn the surface, Cylvia Hayes looked like the perfect First Lady of Oregon: neat, brown hair; wide, toothy grin; conservative clothing and a warm demeanor. She came from made-for-campaign-literature beginnings and had a cause to which she devoted her life.\n\nBut Hayes also had secrets: a past life as the green-card wife of an Ethiopian teenager, plans to use a 60-acre farm in rural Washington to grow marijuana, and a suspicious amount of influence in the gubernatorial administration of her boyfriend, all of which raised questions about a conflict of interest with her own work as a policy consultant.\n\nOn Thursday, outrage over Hayes multiple scandals reached its conclusion. Her fianc, Gov. John Kitzhaber, resigned, putting an end to his more than three-decades-long career in Oregon politics, 20 years of which were spent in the governors office.\n\nI am in love, Kitzhaber said when asked about Hayes alleged wrongdoings at a press conference on Jan. 30. I have no regrets over my personal relationship with Cylvia Hayes. She is a wonderful lady.\n\nA wonderful lady, but perhaps also a con artist.\n\nHayes was born on Aug. 10, 1967, in Seattle. She was raised in a ramshackle home in rural Washington that previously had been a hippie commune, according to a January 2011 Oregonian profile.\n\nHayes, who did not return phone calls or Facebook messages requesting comment, claims that her fathers drinking problem forced her out on her own by age 16. She then couch-surfed until she finished high school. She says she earned a masters degree in environmental studies from Evergreen State College, a liberal-arts school in Olympia, Wash., sometime after 1997, when she first arrived in Oregon.\n\nThe Oregonian reported that Hayes was trained by former Vice President Al Gore to lecture on climate change, but there are no details about what, exactly, that means.\n\nHayes founded a environmental poli"}, {"title": "Ukraine Fighting Persists as Countdown to Cease-Fire Starts", "author": "Daryna Krasnolutska", "text": "(Bloomberg) -- Fighting intensified in eastern Ukraine as the clock ticked down to a cease-fire thats supposed to go into effect at midnight.\n\nPro-Russian separatists and government forces made the last push to maximize territory under their control, with the government in Kiev saying rebels are attacking along the entire front line, from the strategic transport hub of Debaltseve to the Sea of Azov port of Mariupol. The insurgents blamed the Ukrainian army for striking their positions and towns across the breakaway Donetsk region.\n\nA rebel offensive centered on Debaltseve is threatening to wreck the deal brokered by the leaders of Russia, Ukraine, Germany and France during all-night negotiations in the Belarus capita, Minsk. Similar agreements have previously failed to defuse the almost one-year crisis thats killed more than 5,400 people. The cease-fire is set to start overnight Saturday to Sunday at midnight Kiev time.\n\nThe first volatility point is whether or not the cease-fire materializes this weekend, Sebastien Barbe, head of emerging markets research and strategy at Credit Agricole CIB, said in a report. Next, there remain plenty of uncertainties in the agreement that need to be clarified and which will likely fuel political volatility. The process will likely be bumpy, at best.\n\nThe mounting doubts over the viability of the truce were reflected in Ukrainian dollar bonds. Government notes maturing in July 2017 ended a seven-day rally, falling 2.4 cents to 54.21 cents. Russian markets showed signs of optimism that the country will be able to avert tougher sanctions, with stocks and bonds extending a second week of gains and the ruble strengthening.\n\nSeparatist forces, backed by Russian regular troops, were on an offensive to secure more territory before midnight, Andriy Lysenko, a Ukrainian military spokesman, said Saturday. Seven Ukrainian soldiers were killed and 23 wounded in the past 24 hours, he said, accusing the rebels of failing to comply with the Minsk"}, {"title": "Andrew Wiggins Shines As World Team Beats U.S. In Rising Stars Game  CBS New York", "author": "", "text": "NEW YORK (CBSNewYork/AP)  Andrew Wiggins scored 22 points, Rudy Gobert added 18 points, 12 rebounds and three blocked shots, and the World team beat the U.S. 121-112 on Friday night in the Rising Stars Challenge at All-Star weekend.\n\nWiggins, the No. 1 pick from Canada who plays for Minnesota, was chosen as the games MVP.\n\nBrooklyns Bojan Bogdanovic of Croatia, playing on his home court, and Chicagos Nikola Mirotic from Montenegro each added 16 points for the World.\n\nOrlandos Victor Oladipo and Zach LaVine of Minnesota each scored 22 points for the U.S. team in the game between rookies and second-year players.\n\nIt was another new format for the opening game of All-Star weekend, which originated as a contest between teams of rookies, later turned into rookies against second-year players, and this year changed to the world against U.S. players.\n\nWeve got to re-arrange this game, U.S. coach Alvin Gentry said, according to NBA.com. I think it should be North America against the World. And then that way we get Canada. If we get Canada, we have Wiggins on our team.\n\nIt looked like all the other versions, with lots of 1-on-1 play and little defense beyond Gobert, the French center who impressively stuffed Nets center Mason Plumlee late in the game with the World protecting a narrow lead.\n\nSome of the dunks were impressive  all four contestants in Saturdays slam dunk contest were in Fridays game  but the play was spotty. Oladipo shot 8 for 21 and the teams combined for 51 turnovers.\n\nMinnesotas Gorgui Dieng of Senegal finished with 14 points and Milwaukees Giannis Antetokounmpo of Greece had 12 points and 10 rebounds for the World. Hes in the dunk contest Saturday along with LaVine, Oladipo and Plumlee.\n\nUtahs Trey Burke scored 17 points for the U.S. and Plumlee had 13 points and nine rebounds."}, {"title": "Did Argentina's President Order An Assassination?", "author": "Mar A Julia Oliv N", "text": "The president of Argentina was indicted today for her involvement in allegedly covering up an Iranian terrorist plot. What happens now?\n\nBUENOS AIRES  Argentine Federal Prosecutor Gerardo Pollicita on Friday indicted President Cristina Fernndez de Kirchner, her Foreign Minister Hctor Timmerman and Congressman Andres Larroque for allegedly covering up the involvement of Iranian officials in the 1994 terrorist attack on a Jewish center that killed 85 people and injured hundreds more.\n\nIt is a political earthquake in a country that has seen more than its share of military dictatorships, coups and financial instability, so what happened today in Argentina is a scandal with global impact.\n\nThe indictment follows the death of prosecutor Alberto Nisman on Jan. 18, who was found dead with a shot to the head in his apartment. Just a few days before he was found, he was preparing to file charges against the president.\n\nPollicita acted on Nismans 289-page criminal case, which is now in the hands of Judge Daniel Rafecas, who can decide to move forward or dismiss the case.\n\nNothing is predictable in a country in shock over the death of a prosecutor who was just about to indict the president. A country that after 12 years of Kirchners government will vote for a new president in eight months. A country in which, according to the polls, most of the public thinks Nisman was the victim of a crime that will never be solved. A country where federal prosecutors called for a pro-Nisman march next Wednesday to demand independence from political influence.\n\nKirchner and her allies have accused federal prosecutors of siding with opposition parties in a bid to orchestrate a judicial coup against her.\n\nOn Friday morning, Kirchners chief of staff, Anibal Fernandez, accused the prosecutors organizing the Feb. 18 march of anti-Semitism and drug trafficking, and the president has yet to offer her condolences to Nismans family.\n\nSuch is the confusion in the country todaythe day in which the indict"}, {"title": "Yemeni Houthi fighters fire on protesters after clashes kill 26", "author": "Mohammed Ghobari", "text": "1 of 3. Anti-Houthi protesters shout slogans during a demonstration against the Shi'ite Muslim militia group in the southwestern city of Taiz February 14, 2015.\n\nIt was the second day of nationwide demonstrations against the Iranian-backed Houthis in less then a week after its dissolution of parliament this month unravelled security and sent Western and Arab embassies packing.\n\nActivists said they were enraged by the death on Saturday of Saleh al-Bashiri, who they say was detained by gunmen as they broke up an anti-Houthi protest in Sanaa two weeks ago and was released to a hospital with signs of torture on his body on Thursday. There was no immediate comment from the Houthis.\n\nYemen's upheaval has drawn international concern as it shares a long border with top world oil exporter Saudi Arabia, and the country is also fighting one of the most formidable branches of al Qaeda with the help of U.S. drone strikes.\n\nHeavy clashes between Houthi fighters and Sunni Muslim tribesmen fighting alongside Al Qaeda militants in the southern mountainous province of al-Bayda on Saturday killed 16 Houthi rebels along with 10 Sunni tribesmen and militants, security officials and tribal sources told Reuters.\n\nThe state faces collapse in impoverished, strife-torn Yemen two weeks after the Houthis took formal control of the country and continued an armed push southward.\n\nFrance, the United States, Britain, Germany, Italy and Saudi Arabia have closed their missions in the capital Sanaa and withdrawn staff, citing security concerns.\n\nSpain and the United Arab Emirates announced the closure of their embassies in Sanaa on Saturday.\n\nThe United Arab Emirates' state news agency WAM cited \"the increasing deterioration of the political and security situation Yemen is witnessing and the tragic events after the Houthis undermined the legitimate authority.\"\n\nYemen's rich Sunni Gulf Arab neighbours loathe the Houthi fighters and have called their rise to power a \"coup.\"\n\nThe embassy closures have i"}, {"title": "Jeb Bushs fundraising is obliterating other 2016 GOP candidates: report", "author": "", "text": "Although the news doesnt mean other GOP candidates are sunk, it does further establish Bush as the clear frontrunner for the Republican nomination.\n\nJeb Bushs candidacy for president really only began in earnest a few weeks ago, but already he is leaving his competition behindwhen it comes to donors.\n\nBushs two political committees are on pace to raise an unprecedented amount of cash  tens of millions of dollars  by the early spring, which would place him overwhelmingly above potential competitors for the GOP nomination for a 2016 White House bid, according to a Washington Post report.\n\nIt appears that the wealthiest of donors have quickly moved to back Bush now that Mitt Romney, who likely would have been his biggest competition for donor dollars, has bowed out of the race.\n\nThe Post reported that Bush pulled in at least $100,000 each from 25 attendees at a recent fundraiser in Manhattan, one of six events scheduled for Bushs political action committee. He has another scheduled next weekend in Palm Beach that will sports a similar minimum price tag.\n\nBush has been clamoring for that money, and he is hosting fundraisers at an average of one per day, something that no other Republican competitor is likely to be able to compete with.\n\nIt means that other GOP candidates have their work cut out for them, such New Jersey Gov. Chris Christie, Wisconsin Gov. Scott Walker, former Texas Gov. Rick Perry, and Kentucky Sen. Rand Paul, to name a few.\n\nHowever, dont just write off everyone else yet. There is still plenty of time for rivals to catch up, mainly because of how the rules of the game are set. Super PACs are able to collect an unlimited amount of money, and the amount of potential donors has expanded in recent years.\n\nThe financial momentum is certainly further pushing Bushs case that he is the frontrunner, and perhaps the best candidate to defeat a Democratic nominee  perhaps clear frontrunner Hillary Clinton.\n\nThere is concern among Christies camp that interest in hi"}, {"title": "Co-worker reportedly warned limo boss about Bob Simons erratic driver", "author": "", "text": "A co-worker of Bob Simon's black-car driver had been so concerned about the disabled operator's \"erratic driving\" that he warned superiors to fire him  just two days before the man crashed and killed the famed \"60 Minutes\" correspondent.\n\nAbdul Reshad Fedahi's colleague complained about him because passengers had been griping about his behavior at the wheel, sources told The Post Friday.\n\n\"Management said they'll check with the lawyers, and they said if he has a valid license, he can work,\" another driver added. \"And then this happened.\"\n\nFedahi, 44, whose license had been suspended nine times, is suspected of speeding before the crash on the West Side Highway that killed Simon Wednesday evening.\n\nInvestigators believe Fedahi  who has the use of only one arm following a failed suicide bid  accidently hit the gas instead of the brake after his Lincoln Town Car grazed a Mercedes-Benz C30 in the center lane.\n\nHis sedan then veered to the left and smashed into the metal posts that divide the road.\n\nSimon, 73, a renowned war reporter, was sitting in the back seat without a seat belt on and suffered a fatal broken neck and head trauma.\n\nFedahi has been hospitalized with two badly broken legs and a broken arm.\n\nLaw-enforcement sources said Friday that he is sticking to the story he told his relatives just after the accident: \"I blacked out, and I think I got hit from behind.\"\n\nClick for more from NYPost.com"}, {"title": "Reckless police behavior? Fatal shooting in Washington state is under review by coroner", "author": "", "text": "Police say that when the man refused to stop throwing rocks at them and the stun gun didnt work, they decided to pull out their guns and shoot him.\n\nAn inquest has been ordered into the fatal shooting of a man who was throwing rocks at officers in Washington state, which was captured on video and caused a public outcry.\n\nFranklin County coroner Dan Blasdel ordered the inquest to determine whether police were justified in gunning down Antonio Zambrano-Montes during a confrontation in the city of Pasco, 200 miles southeast of Seattle in the tri-cities region of the state, according to a Reuters report.\n\nIt is rare for the coroners office to make such an inquest, and it will be just the third in Blasdels 20 years as state coroner.\n\nThe case has attracted the interest of Mexicos Foreign Affairs Ministry, as Zambrano-Montes, who worked in a Washington orchard, was originally from southern Mexico. The ministry called for an investigation into his killing.\n\nThe shooting prompted protests in Pasco, which is home to 68,000, including a large Hispanic community who often work in local apple orchards. It also comes amid heightened tensions with police nationwide after the killings of unarmed black men by white police officers in Missouri and New York.\n\nZambrano-Montes was not armed with a knife or gun during the Tuesday altercation in a grocery store parking lot that eventually spilled onto a busy street corner. The man was pelting officers with rocks and ignored commands to stop.\n\nWhen a stun gun didnt work and he continued to refuse commands to stop, the officers pulled out their guns and shot him to death.\n\nA 22-second video by a nearby driver captured the incident, which does appear to show Zambrano-Montes throwing rocks, but shows that he was running away from the officers when he was finally killed. After apparently throwing one rock, several shots can be heard, and then he crosses the street, turns to face the officers, raises his arm as if to throw another rock, and th"}]